RIET/src/Catalogs/Services/Services.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Services</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CustomFeesAndPenaltiesPaidByCCA</name>
      <description>Custom Fees and Penalties (paid by CCA)</description>
    </items>
  </predefined>
  <attributes>
    <name>DescriptionEng</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SumCalculationMethod</name>
    <type>
      <types>EnumRef.SumCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>AllocationArea</name>
    <type>
      <types>EnumRef.AllocationAreas</types>
    </type>
  </attributes>
  <attributes>
    <name>AllocationMethod</name>
    <type>
      <types>EnumRef.AllocationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>DutiesRecharge</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Local</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ports</name>
    <attributes>
      <name>Port</name>
      <type>
        <types>CatalogRef.SeaAndAirPorts</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Enums/AllocationAreas/AllocationAreas.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllocationAreas</name>
  <enumValues>
    <name>Shipment</name>
  </enumValues>
  <enumValues>
    <name>CCD</name>
  </enumValues>
  <enumValues>
    <name>InvoiceLines</name>
  </enumValues>
  <enumValues>
    <name>Parcel</name>
  </enumValues>
  <enumValues>
    <name>Trip</name>
  </enumValues>
  <enumValues>
    <name>TripLEFD</name>
    <comment>Trip, Legal entity, Final destination</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Services/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
			
	ПроверитьРеквизитыБезДополнительныхДанных(Отказ);
	
КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Код = СокрЛП(Код);
	DescriptionEng = СокрЛП(DescriptionEng);
	Наименование = СокрЛП(Код) + "-" + DescriptionEng;
	
	Если НЕ ЭтоГруппа Тогда
		Ports.Свернуть("Port", "");
		ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(Ports, "Port");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРеквизитыБезДополнительныхДанных(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Code"" is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(DescriptionEng) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Description eng."" is empty!",
			ЭтотОбъект, "DescriptionEng", , Отказ);	
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(SumCalculationMethod) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Sum calculation method"" is empty!",
				ЭтотОбъект, "SumCalculationMethod", , Отказ);
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(AllocationArea) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Allocation area"" is empty!",
				ЭтотОбъект, "AllocationArea", , Отказ);
		КонецЕсли; 

		Если НЕ ЗначениеЗаполнено(AllocationMethod) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Allocation method"" is empty!",
				ЭтотОбъект, "AllocationMethod", , Отказ);
		КонецЕсли; 
		
		Если DutiesRecharge
			И ЗначениеЗаполнено(AllocationArea)
			И НЕ AllocationArea = Перечисления.AllocationAreas.CCD Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"For Duties recharge you can only choose ""CCDs"" as Allocation method!",
				ЭтотОбъект, "AllocationMethod", , Отказ);
			
		КонецЕсли; 
		
	КонецЕсли;	
		
КонецПроцедуры
